BUTTON_MY_ORDERS = "📝 Мои заказы"
BUTTON_SEND_CODE = "📧 Отправить новый код"

COMMAND_ORDERS = "/orders"

MESSAGE_GREETINGS = """
🌟 Добро пожаловать в "Поглажу"!

Профессиональная глажка одежды с доставкой по городу.

🚀 **Быстро:** Готово за 24 часа
💰 **Выгодно:** Накопительные бонусы  
🏆 **Качественно:** Опытные мастера

Давайте начнем!
👇 Для начала предоставьте свой номер телефона:
"""

MESSAGE_REGISTRATION_OVER = f"""
🎉 Регистрация завершена!

Поздравляем, теперь вы клиент "Поглажу"!

📋 **Что дальше:**
1️⃣ Посмотрите список своих заказов - {COMMAND_ORDERS}
2️⃣ Дождитесь уведомления о статусах своих заказов
"""

MESSAGE_RETURN_BACK = f"""
С возвращением! 👋

Рады видеть вас снова в "Поглажу"! 
Что будем гладить сегодня? 😊

{COMMAND_ORDERS} - Получить список своих заказов
"""